{
    "about_me" : "대학교 재학시절 학부 연구원으로 코딩을 처음 접한 후 데이터 처리, 데이터 가시화 등을 주로 담당하였습니다. 이후 GeoSR 해양예보부에 입사하여 데이터를 다루고 시스템 엔지니어로서 국립해양조사원 서버관리를 진행하며 개발 실력을 키워나갔습니다. 그 이후엔 SSAFY라는 삼성 소프트웨어 교육에 1년간 참여하며 웹 풀스택 개발 공부를 하며 CS 지식, 알고리즘, 프로젝트 전반적인 이해와 진행을 해왔습니다. 그 프로젝트는 앱과 웹 그리고 오픈소스 프로젝트입니다.",
    "my_project": [
      "1. Booking - 오프라인 독서모임 매칭 및 관리 안드로이드 앱 프로젝트 (안드로이드 앱 개발)\n- SSAFY (Samsung Software Academy) 에서의 팀프로젝트 활동으로 진행하였습니다.\n- Python Web Full stack 과정을 수료하였지만 App으로 개발하는 것이 더 나을것으로 판단되어 안드로이드 네이티브 앱으로 개발된 프로젝트입니다.\n\n다음은 제가 구현한 내용입니다.\n\n위치 권한 허용을 통한 위치 기반 회원 가입 & 로그인 페이지\n\nGoogle Social Login 구현\n- Google Firebase OAuth 2.0 SDK 인증 방식을 통하여 구현.\n- Firebase SDK 연결로 Firebase 실시간 데이터베이스를 사용할 수 있어 사용자 관리가 용이함.\n회원가입 페이지 구현\n- com.google.android.gms.location 라이브러리를 이용한 위치 권한 허용을 묻고 회원 정보에 위치 정보 전달.\n\n도서 검색 기능 및 관련 페이지\n- onValueChange 를 이용해 검색어 타이핑에 따른 실시간 책 검색 기능 제공\n- When 문을 통하여 BookSearchState.Loading, Error, Success 등 state에 따른 페이지 처리로 사용성 증대\n\n마이페이지\n- 회원 정보 수정, 팔로우-팔로워, 내 서재 등의 내 정보 관련 기능 구현\n- Naver Cloud API 에 프로필 Image 를 저장하고 프로필 이미지가 변경되었을 때 덮어 씌우며 수정\n\n프로젝트에서 사용한 기술 스택\n- Dagger - Hilt, Retrofit2, okHttp, Jetpack Compose\n- Coroutine 을 이용한 비동기 처리\n- Naver Cloud API 를 이용한 Image 처리\n- MVVM 디자인패턴 중 가장 기본이 되는 View / View Model 의 철저한 구분을 목표로 하여 적용해보았습니다.\n- Multi Module 기반(ui, domain, data) 의 기초적인 클린아키텍처 적용을 최대한 시도해보려 노력하였습니다.",
      "2. Samsung ONE CAPI Pybinding For python runtime (Samsung Research & SSAFY) (open source 컴트리뷰터 활동)\n- SSAFY (Samsung Software Academy) 에서의 팀프로젝트일환으로 Samsung Research 연구원분들과 협업을 통해 비대면으로 진행되었습니다.\n- 기존에 CAPI 로 개발된 삼성 온디바이스 Runtime 엔진을 AI 개발자들이 선호하는 언어인 Python 으로 Pybinding 하는 프로젝트를 기획하였고 다양한 물리적환경(arm32, aarch64 등 디바이스)에서 많은 사용자들이 쉽게 온디바이스 runtime 환경 구동이 가능하도록 환경별 세팅을 한뒤 pypi에 배포하였습니다.\n\n다음은 제가 구현한 내용입니다.\n\nPython Binding\n- Pybind11 라이브러리를 사용하여 기존의 C++ 코드를 함수별로 1:1 매칭하였습니다.\n- 이 과정에서 C++의 포인터와 더블 포인터에 직관적으로 매칭되는 Python 개념이 없어, Python의 Class와 `__init__` 초기화 함수 및 `super().__init__`을 사용하여 문제를 해결하였습니다.\n- Cross Compile 지원을 통해 platform 라이브러리를 활용하여 아키텍처를 자동으로 인식하도록 로직을 구현하여 사용성을 향상시켰습니다.",
      "3. GeoSR 해양예보부 인턴업무를 진행하며 수행한 프로젝트입니다.\n2021.12.01 ⏤ 2022.04.01\n\n국립해양 조사원의 시스템 엔지니어로 파견업무를 담당했습니다.\n1. System Engineer 로서 국립해양 조사원의 Linux(CentOS 7) 서버를 관리/운영하며 데이터 백업, 서버 이전, 충돌 해결 업무를 수행했습니다.\n2. 서버 별 Process & Threads 성능을 통한 (수치, AI) 모델의 수행 시간 예측을 계산하고 서버 이전을 진행하여 5%+ 서버 성능을 개선하였습니다."
    ],
    "my_achivement": "2023 SSAFY 최우수 교육생 (1위) 2023.06\nSSAFY 9기 광주 지역 교육생 150 명 중 1학기 성적 우수 시상\n그 중 상위 6명의 최우수 교육생을 선발함.\n- Python Web Full Stack 과정 수료 중 알고리즘, CS, Web Project 등의 다양한 평가에서 광주 지역 상위 6인에 선정\n\n2023 SDC Korea 2023 Project (2위) 2023.10\nSSAFY 9기 전체 교육생 1150명 중 상위 36인을 선정\n6인팀으로 된 교육생이 SDC Korea 2023 발표를 두고 프로젝트 경쟁하는 대회\n- Samsung Research 현업 개발자들과 ONE 오픈 소스에 참여하여 프로젝트를 진행\n- 위 프로젝트로 2위에 입상하여 SDC Korea 2023 에 참여함.\n\n2024 K-Water 대국민 물 빅데이터 공모전(우수상) 2024.08\n한국수자원공사에서 주최한 공공데이터를 활용한 물 관련 빅데이터 공모전에 참여\n2인팀으로 구성된 팀중 팀장을 맡아 지하수 수위 예보 안드로이드 앱을 제작, 배포함\n- 한국수자원공사 사내 개발 2인팀으로 구성하여 공모전에 참여\n- 위 프로젝트에서 팀장 및 개발 / 발표를 담당하며 우수상 수상"
  }